<template>
    <div class="min-h-screen bg-gradient-to-r from-cyan-500">
      <section class="  bg-center 2xl:mx-auto sm:py-6 sm:px-7 py-5 px-4 ">
        <div class="container flex flex-col justify-center px-4 py-8 mx-auto md:p-8">
          <div class="flex space-x-3 items-center mb-10">
            <NuxtLink to="/"> <img src="/img/logo.png" width="200" height="200" alt="circle" /> </NuxtLink>
            <h1 class=" font-normal text-4xl leading-6 text-cyan-900" >Fantasy Game Forum</h1>
          </div>
          <h2 class="text-4xl font-semibold sm:text-4xl">Заходя на наш форум вы соглашаетесь со следующими правилами: </h2>
          <p class="mt-4 mb-8 sm:text-2xl  dark:text-cyan-600">Если ваш возраст составляет меньше восемнадцати лет, мы просим покинуть наш форум! (18+)</p>
          <div class="space-y-4">
            <details class="w-full border rounded-lg">
              <summary class="px-4 py-6 focus:outline-none focus-visible:ring-violet-400">Политика форума</summary>
              <p class="px-4 py-6 pt-0 ml-4 -mt-4 dark:text-cyan-400">
                1 .Будьте уважительны к другим участникам <br /><br />
                Мы ценим дружелюбное и уважительное общение на нашем форуме. Пожалуйста, избегайте оскорбительных выражений, троллинга или провокационного поведения по отношению к другим участникам.<br /><br />

                2. Никаких оскорблений или домогательств<br /><br />
                Любые оскорбительные, дискриминационные или домогательские комментарии строго запрещены. Это включает использование нецензурной лексики, угрозы насилия и личные нападки.<br /><br />

                3. Без спама и саморекламы<br /><br />
                Разрешена разумная самореклама и рекомендации, но чрезмерный спам и самореклама будут удалены. Пожалуйста, не публикуйте одно и то же сообщение в нескольких темах.<br /><br />

                4. Никаких пиратских материалов<br /><br />
                Запрещено распространение пиратских игр, программного обеспечения или другого защищенного авторским правом контента. Это нарушает закон и правила форума.<br /><br />

                5. Соблюдайте тематику<br /><br />
                Пожалуйста, придерживайтесь заявленной тематики каждого подфорума. Сообщения, не относящиеся к теме, могут быть перемещены или удалены модераторами.<br /><br />

                6. Используйте теги спойлеров<br /><br />
                Если ваше сообщение содержит спойлеры к сюжету игры, используйте специальные теги или предупреждение, чтобы не портить другим удовольствие от прохождения.<br /><br />

                7. Никакой незаконной деятельности<br /><br />
                Любое обсуждение или планирование незаконной деятельности строго запрещено и приведет к немедленному бану.<br /><br />
              </p>
            </details>
            <details class="w-full border rounded-lg">
              <summary class="px-4 py-6 focus:outline-none focus-visible:ring-violet-400">Контент, модерация форума и правила</summary>
              <p class="px-4 py-6 pt-0 ml-4 -mt-4 dark:text-cyan-400">1. Контент форума не содержит медиа файлы, фото, видео эротического характера, педофилии, аниме рисунков, медиафайлов в стиле “яой”. <br /> <br />
                2. Если кто-то из пользователей форума выкладывает подобного рода контент, то модераторы форума резко пресекают такие действия и данный пользователь удаляется с форума. <br /> <br />
                3. Публикуя сообщения на форуме, вы являетесь совершеннолетним и соглашаетесь с нашими правилами о ЗАПРЕТЕ: <br /> <br />

                • Рекламы и любых коммерческих объявлений без согласования с администрацией форума;  <br /> <br />

                • Оскорблений и публичных обвинений других участников; <br /> <br />

                • Публикаций фото-/видео- интимного и эротического содержания; <br /> <br />

                • Агитации и привлечения к употреблению
                наркотических/психотропных веществ, в том числе курения запрещённых, экстремизма, призыва к суициду; <br /> <br />

                • Публикаций чужих данных, в том числе почта, телефон, конкретный адрес, фотографий 3-х лиц и т.д.; <br /> <br />

                • Дискуссии на политические и религиозные темы <br /> <br />

                4. Форум создан исключительно для того, чтобы люди с сексуцальными нетрадицонными отношениями *(сексульные меньшинства) достигшие восемнадцати лет или больше могли иметь знакомства и общение с подобными им людьми *(сексуальные меньшинства).
              </p>
            </details>
            <details class="w-full border rounded-lg">
              <summary class="px-4 py-6 focus:outline-none focus-visible:ring-violet-400">Политика конфиденциальности</summary>
              <p class="px-4 py-6 pt-0 ml-4 -mt-4 dark:text-cyan-400">1. Общие положения   <br /> <br />
                При создании данной Политики конфиденциальности учитывались законодательные требования Российской Федерации и стремление обеспечить защиту прав пользователей на конфиденциальность личной информации.   <br /> <br />

                Настоящая Политика конфиденциальности регулирует сбор, хранение и использование личных данных пользователей, предоставленных при регистрации и использовании данного веб-форума. Ваше использование форума подразумевает ваше согласие с данной Политикой конфиденциальности. Если вы не согласны с этими условиями, пожалуйста, не используйте данный форум.  <br /> <br />
                1. Сбор и хранение личных данных.  <br /> <br />
                Форум собирает и хранить только те личные данные, которые необходимы для предоставления услуг и функций форума. Личные данные могут включать имя, адрес электронной почты, номер телефона, пол, возраст и другую информацию, предоставленную пользователем при регистрации или использовании сервисов форума. Вся информация хранится на защищенных серверах и используется только для предоставления услуг форума.  <br /><br />
                2. Использование личных данных <br /><br />
                Форум использует предоставленную информацию для следующих целей:  <br /><br />
                ● Предоставление и улучшение функционала форума; <br />
                ● Предоставление пользователю персонализированных рекомендаций и предложений; <br />
                ● Обеспечение безопасности пользователей и предотвращение мошеннических действий; <br />
                ● Обратная связь с пользователями и обработка претензий; <br />
                ● Проведение анонимной статистической обработки данных для улучшения работы форума. <br /><br />
                2. Раскрытие личных данных третьим лицам.  <br /><br />
                Форум обязуется не передавать личные данные пользователей третьим лицам, за исключением случаев, предусмотренных законодательством Российской Федерации.  <br /><br />
                3. Защита личных данных.  <br /><br />
                Форум принимает все необходимые меры для обеспечения безопасности хранения и обработки личных данных пользователей, включая использование шифрования и других технологий защиты информации.  <br /><br />
                4. Изменение Политики конфиденциальности.  <br /><br />
                Форум оставляет за собой право в любой момент вносить изменения в настоящую Политику конфиденциальности. Изменения вступают в силу с момента публикации новой версии Политики конфиденциальности  на форуме. <br /><br />
                5. Пользователи обязуются регулярно знакомиться с изменениями в Политике конфиденциальности.  <br /><br />
                6. Обратная связь.  <br /><br />
                При возникновении вопросов или замечаний по поводу настоящей Политики конфиденциальности, пользователи могут обратиться к администрации форума через форму обратной связи или по указанным контактным данным. <br /><br />
                <br /> <br /></p>
            </details>
            <div class="flex flex-col gap-4 mt-4 w-80 mx-auto ">
              <NuxtLink to="forum">   <button class="rounded-md flex space-x-2 w-full h-10 font-normal text-sm leading-3 text-cyan-700 bg-cyan-600 bg-opacity-0 hover:opacity-100 duration-100 border border-cyan-700 focus:outline-none focus:bg-cyan-200 hover:bg-cyan-200 duration-150 justify-center items-center" >Accept</button> </NuxtLink>
              <NuxtLink to="https://google.com"> <button class="rounded-md flex space-x-2 w-full h-10 font-normal text-sm leading-3 text-white bg-cyan-700 focus:outline-none focus:ring-2 focus:ring-offset-2 focus:ring-cyan-700 focus:bg-cyan-600 hover:bg-cyan-600 duration-150 justify-center items-center" > Decline</button></NuxtLink>
            </div>
          </div>
        </div>
      </section>
    </div>
  </template>


<script setup>

</script>

<style scoped>

</style>